aaron-bond.better-comments
charliermarsh.ruff
cschlosser.doxdocgen
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
littlefoxteam.vscode-python-test-adapter
monokai.theme-monokai-pro-vscode
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.test-adapter-converter
njpwerner.autodocstring
ritwickdey.liveserver
vscode-icons-team.vscode-icons
